package tutorial.com.lee;

import java.util.Scanner;

public class Exam_06 {

/*
 * 4단계
 * 
 * 도형(1.원  2.사각형  3.도형보기  4.종료)
 * 선택 = 1
 * x = 1
 * y = 1
 * r = 5
 * 
 * 도형(1.원  2.사각형  3.도형보기  4.종료)
 * 선택 = 2
 * x =5 
 * y =5
 * h = 10
 * z = 4
 * 
 * 도형(1.원  2.사각형  3.도형보기  4.종료)
 * 선택 =3 
 * 점(x, y) = (1, 1)
 * 반지름 = r
 * 
 * 점(x, y) = (5, 5)
 * 너비 = 4, 높이 = 10
 * 
 * <처리 조건>
 * 1. 10개의 도형만 담아 관리한다.
 * 		단, 도형이 원이든 사각형이든 상관없고, 반드시 도형의 개수는 합이 10개
 * 		예) 원3, 사각 7
 * 2. 사용자가 원하는 도형을 추가할 수 있도록 구현한다. 
 * 3. 언제든지 사용자가 원하면 이전까지 입력한 도형을 출력하여 보여준다. 
 * 4. 프로그램이 언제든 종료될 수 있도록 구현한다. 
 * 5. 기타조건은 흐름에 맞긴다. 
 * 
 * 
 */
	
	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		int menu = 0;
		
		while(true) {
			
		}
		
	}

}
